In [1]:
import os
os.getcwd()

'C:\\Users\\HSS\\quiz1'

In [2]:
%run C:\\Users\\HSS\\dd.py

In [3]:
kospi_df = pd.read_csv('kospi.csv')

In [4]:
kospi_df.info() #missing data 없음

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 10 columns):
aq      10000 non-null int64
cr      10000 non-null float64
cv      10000 non-null int64
dt      10000 non-null int64
hv      10000 non-null float64
lv      10000 non-null float64
ncv     10000 non-null int64
ov      10000 non-null float64
rf      10000 non-null int64
name    10000 non-null object
dtypes: float64(4), int64(5), object(1)
memory usage: 781.3+ KB

In [5]:
kospi_df.tail(2)

,aq,cr,cv,dt,hv,lv,ncv,ov,rf,name
9998,1053114,0.763359,40,20190718,5340.0,5240.0,5280,5240.0,2,메리츠종금증권
9999,1146495,-0.380228,-20,20190717,5350.0,5220.0,5240,5260.0,5,메리츠종금증권

In [15]:
#cr :상승률, cv: 등락, dt: 날짜, hv: 변동성(역사적), ncv: 종가

### Q1. 유니크한 날짜수와 기업수

In [6]:
print('Name: ',len(list(kospi_df['name'].unique())))
print()
print('DATE: ',len(list(kospi_df['dt'].unique())))

Name:  100

DATE:  100

### Q2. 2019 12 08 이후의 날짜별 평균 상승률을 소수 셋째자리까지 리스트의 딕셔너리 형태로 나타내시오

In [106]:
kospi_df.head(3)
#날짜, 이름 순 정렬

,aq,cr,cv,dt,hv,lv,ncv,ov,rf,name
0,6873613,0.590000,300,20191210,51600.0,50700.0,51500,51000.0,2,삼성전자
1,8470627,1.587301,800,20191209,51400.0,50700.0,51200,50900.0,2,삼성전자
2,11414563,1.818182,900,20191206,50900.0,49950.0,50400,50100.0,2,삼성전자

In [240]:
kospi_sorted = kospi_df.sort_values(['name','dt','cr'],ascending = True)[['name','dt','cr']]
kospi_sorted = kospi_sorted[['dt','name','cr']]
kospi_sorted = kospi_sorted[kospi_sorted['dt']>20191208]
kospi_sorted.head(3)

            dt     name        cr
8501  20191209   BGF리테일 -2.140673
8500  20191210   BGF리테일  1.880000
9201  20191209  BNK금융지주 -0.135318

In [241]:
ans = kospi_sorted.groupby('dt').mean()['cr']
ans = ans.reset_index()
ans

         dt        cr
0  20191209 -0.041143
1  20191210  0.544600

### Q4. 2019년 10월 21일 상승률 상위 5개 회사를 출력하시오

In [242]:
kospi_sorted = kospi_df.sort_values(['name','dt','cr'],ascending = True)[['name','dt','cr']]
kospi_sorted = kospi_sorted[['dt','name','cr']]

In [243]:
kospi_sorted = kospi_sorted[kospi_sorted['dt']==20191021]

In [244]:
ans2 = kospi_sorted.groupby('name').sum()['cr'].reset_index()

In [245]:
ans2 = ans2.sort_values('cr',axis = 0,ascending = False)[:5]
ans2

       name        cr
16  LG디스플레이  3.928571
66    엔씨소프트  3.689320
68      오리온  3.000000
52     삼성전기  2.739726
4    CJ제일제당  2.690583

### Q5. 2019년 11월 30일에서 12월 5일까지 일별 상승률 상위5개 회사의 평균 상승율을 소수점 셋째 자리까지 출력하세요.

In [246]:
kospi_sorted = kospi_df.sort_values(['name','dt','cr'],ascending = True)[['name','dt','cr']]
kospi_sorted = kospi_sorted[['dt','name','cr']]
kospi_sorted.head()

            dt    name        cr
8599  20190717  BGF리테일  2.005012
8598  20190718  BGF리테일  0.000000
8597  20190719  BGF리테일  2.211302
8596  20190722  BGF리테일 -4.086538
8595  20190723  BGF리테일  2.506266

In [247]:
idx1 = kospi_sorted['dt'] >= 20191130

In [248]:
idx2 = kospi_sorted['dt'] <= 20191205

In [249]:
kospi_sorted = kospi_sorted[idx1*idx2]

In [250]:
kospi_sorted.sort_values('dt').head(3)

            dt    name        cr
8506  20191202  BGF리테일  0.595238
6106  20191202     에스원  2.029914
3506  20191202     넷마블  1.590909

In [251]:
ans5 = kospi_sorted.groupby('name').mean()['cr'].reset_index().sort_values('cr',ascending= False).head(5)

In [252]:
ans5

        name        cr
88       한진칼  2.816390
1    BNK금융지주  1.500651
76  포스코인터내셔널  1.409590
39      두산밥캣  0.949353
52      삼성전기  0.904271

In [253]:
round(np.mean(ans5['cr']),3)

1.516

### Q6. 전체 기간에서 평균 등락이 가장 높은 3개의 회사 이름과 평균 등락 수치를 구하시오

In [254]:
kospi_sorted = kospi_df.sort_values(['name','dt','cv'],ascending = True)[['name','dt','cv']]
kospi_sorted = kospi_sorted[['dt','name','cv']]
kospi_sorted.head()

            dt    name    cv
8599  20190717  BGF리테일  4000
8598  20190718  BGF리테일     0
8597  20190719  BGF리테일  4500
8596  20190722  BGF리테일 -8500
8595  20190723  BGF리테일  5000

In [255]:
ans6 = kospi_sorted.groupby('name').mean()['cv'].reset_index().sort_values('cv',ascending= False).head(3)

In [256]:
ans6

        name     cv
48  삼성바이오로직스  945.0
22     NAVER  545.0
66     엔씨소프트  400.0

### Q7. 네이버와 한국전력의 종가 데이터의 상관계수를 소수 둘째자리까지 출력하세요 NCV

In [257]:
kospi_sorted = kospi_df.sort_values(['name','dt','ncv'],ascending = True)[['name','dt','ncv']]
kospi_sorted = kospi_sorted[['dt','name','ncv']]
kospi_sorted.head()

            dt    name     ncv
8599  20190717  BGF리테일  203500
8598  20190718  BGF리테일  203500
8597  20190719  BGF리테일  208000
8596  20190722  BGF리테일  199500
8595  20190723  BGF리테일  204500

In [258]:
naver = kospi_sorted[kospi_sorted['name']=='NAVER']
naver.head(3)

           dt   name     ncv
399  20190717  NAVER  119000
398  20190718  NAVER  120500
397  20190719  NAVER  122500

In [259]:
ke = kospi_sorted[kospi_sorted['name']=='한국전력']
ke.head(3)

            dt  name    ncv
1699  20190717  한국전력  25450
1698  20190718  한국전력  25500
1697  20190719  한국전력  25850

In [261]:
ans7 = round(np.corrcoef(naver['ncv'],ke['ncv'])[0,1],2)
ans7

0.48